In [19]:
import pandas as pd
import numpy as np
import copy

In [2]:
tabela = pd.DataFrame({
    'nome':['Rafael', 'Joao', 'Rafael','Maria'],
    'nota':[10,9,8,7]
})

In [3]:
tabela

     nome  nota
0  Rafael    10
1    Joao     9
2  Rafael     8
3   Maria     7

In [4]:
tabela.nome

0    Rafael
1      Joao
2    Rafael
3     Maria
Name: nome, dtype: object

In [5]:
tabela.nome[2]

'Rafael'

In [6]:
tabela['nome']

0    Rafael
1      Joao
2    Rafael
3     Maria
Name: nome, dtype: object

In [8]:
tabela.loc[2,'nome']

'Rafael'

In [9]:
tabela.groupby('nome').mean()

        nota
nome
Joao     9.0
Maria    7.0
Rafael   9.0

In [10]:
tabela.groupby('nome').count()

        nota
nome
Joao       1
Maria      1
Rafael     2

In [11]:
tabela.nota

0    10
1     9
2     8
3     7
Name: nota, dtype: int64

In [12]:
tabela.nota[tabela.nome=='Rafael']

0    10
2     8
Name: nota, dtype: int64

In [ ]:
#dados ou arrays dentro de laços for, if ==> numpy
#sem laços, pandas.

In [14]:
tabela2 = np.array(tabela)

In [15]:
tabela2

array([['Rafael', 10],
       ['Joao', 9],
       ['Rafael', 8],
       ['Maria', 7]], dtype=object)

In [16]:
tabela3 = tabela

In [17]:
tabela3.loc[0,'nota'] = 3

In [18]:
tabela

     nome  nota
0  Rafael     3
1    Joao     9
2  Rafael     8
3   Maria     7

In [20]:
tabela3 = copy.deepcopy(tabela) #alterações na tabela3 nao irão afetar a tabela original.